hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_dac_regs.h
/*
 * HBURST_CFG (RW)
 *
 * DAC support following fixed burst only
 * 000-SINGLE;  011-INCR4;  101: INCR8
 * others are reserved
 */
#define DAC_CFG0_BAK_HBURST_CFG_MASK (0x7U)
#define DAC_CFG0_BAK_HBURST_CFG_SHIFT (0U)
#define DAC_CFG0_BAK_HBURST_CFG_SET(x) (((uint32_t)(x) << DAC_CFG0_BAK_HBURST_CFG_SHIFT) & DAC_CFG0_BAK_HBURST_CFG_MASK)
#define DAC_CFG0_BAK_HBURST_CFG_GET(x) (((uint32_t)(x) & DAC_CFG0_BAK_HBURST_CFG_MASK) >> DAC_CFG0_BAK_HBURST_CFG_SHIFT)

/* Bitfield definition for register: STATUS0 */
/*
 * CUR_BUF_OFFSET (RW)
 *
 */
#define DAC_STATUS0_CUR_BUF_OFFSET_MASK (0xFFFF00UL)
#define DAC_STATUS0_CUR_BUF_OFFSET_SHIFT (8U)
#define DAC_STATUS0_CUR_BUF_OFFSET_SET(x) (((uint32_t)(x) << DAC_STATUS0_CUR_BUF_OFFSET_SHIFT) & DAC_STATUS0_CUR_BUF_OFFSET_MASK)
#define DAC_STATUS0_CUR_BUF_OFFSET_GET(x) (((uint32_t)(x) & DAC_STATUS0_CUR_BUF_OFFSET_MASK) >> DAC_STATUS0_CUR_BUF_OFFSET_SHIFT)

/*
 * CUR_BUF_INDEX (RW)
 *
 */
#define DAC_STATUS0_CUR_BUF_INDEX_MASK (0x80U)
#define DAC_STATUS0_CUR_BUF_INDEX_SHIFT (7U)
#define DAC_STATUS0_CUR_BUF_INDEX_SET(x) (((uint32_t)(x) << DAC_STATUS0_CUR_BUF_INDEX_SHIFT) & DAC_STATUS0_CUR_BUF_INDEX_MASK)
#define DAC_STATUS0_CUR_BUF_INDEX_GET(x) (((uint32_t)(x) & DAC_STATUS0_CUR_BUF_INDEX_MASK) >> DAC_STATUS0_CUR_BUF_INDEX_SHIFT)



/* STEP_CFG register group index macro definition */
#define DAC_STEP_CFG_STEP0 (0UL)
#define DAC_STEP_CFG_STEP1 (1UL)
#define DAC_STEP_CFG_STEP2 (2UL)
#define DAC_STEP_CFG_STEP3 (3UL)

/* BUF_ADDR register group index macro definition */
#define DAC_BUF_ADDR_BUF0 (0UL)
#define DAC_BUF_ADDR_BUF1 (1UL)


#endif /* HPM_DAC_H */
